app/views/movies/index.html.erb

            <th>Average Stars:</th>
            <td><%= format_average_stars(movie) %> (<%=pluralize(movie.reviews.size, "Review")%>)</td>
---
SELECT AVG("reviews"."stars") AS avg_id FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]