app/controllers/reviews_controller.rb

INSERT INTO "reviews" ("comment", "created_at", "movie_id", "name", "stars", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["comment", "fdfasdweefwe"], ["created_at", Wed, 13 Aug 2014 18:54:15 UTC +00:00], ["movie_id", 7], ["name", "hiuh"], ["stars", 2], ["updated_at", Wed, 13 Aug 2014 18:54:15 UTC +00:00]]
---
	def create
		# @movie = Movie.find(params[:movie_id])
		@review = @movie.reviews.new(review_params)
		if @review.save

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 1], ["id", "1"]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 1]]
---
  def destroy
  	# @movie = Movie.find(params[:movie_id])
  	@review = @movie.reviews.find(params[:id])
    @review.destroy

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 7], ["id", "13"]]
---
	def edit
		# @movie = Movie.find(params[:movie_id])
		@review = @movie.reviews.find(params[:id])

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ? AND "reviews"."id" = ? LIMIT 1  [["movie_id", 7], ["id", "13"]]
UPDATE "reviews" SET "comment" = ?, "updated_at" = ? WHERE "reviews"."id" = 13  [["comment", "It may have been a dream or not?"], ["updated_at", Mon, 18 Aug 2014 12:42:42 UTC +00:00]]
---
	def update
		# @movie = Movie.find(params[:movie_id])
		@review = @movie.reviews.find(params[:id])

		if @review.update(review_params)