app/views/reviews/index.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
SELECT COUNT(*) FROM "reviews" WHERE "reviews"."movie_id" = ?  [["movie_id", 1]]
---
<header id="content-header">
	<h1> <%= pluralize(@reviews.size, "Review") %> for <%= link_to(@movie.title, movie_path(@movie)) %> </h1>